# Pandas

In [28]:
import pandas as pd

In [29]:
valores=[6,8,9,12,13 ]
indice=range(len(valores))

serie1=pd.Series(data=valores, index=indice)
serie1

0     6
1     8
2     9
3    12
4    13
dtype: int64

In [30]:
valores2= [28,45,852,3,16 ]
serie2=pd.Series(index=indice,data=valores2)

In [31]:
serie1* serie2

0     168
1     360
2    7668
3      36
4     208
dtype: int64

In [32]:
import numpy as np

In [33]:
array=np.random.normal(-10,10,size=[4,4 ])
array

array([[ -7.15707769, -15.91946935, -21.8154882 , -42.04224362],
       [ -5.28744686, -14.62766796, -17.26919485, -15.35493992],
       [ -9.00129917,  -8.40108428,  12.67378268, -18.51711883],
       [-17.4208309 ,  -1.22268908,  -2.91692276, -20.57055015]])

In [34]:
pd.DataFrame([[2,3 ],[4,5]],index=['a','b'],columns=['W','X' ])

   W  X
a  2  3
b  4  5

In [35]:
pd.DataFrame(array)

           0          1          2          3
0  -7.157078 -15.919469 -21.815488 -42.042244
1  -5.287447 -14.627668 -17.269195 -15.354940
2  -9.001299  -8.401084  12.673783 -18.517119
3 -17.420831  -1.222689  -2.916923 -20.570550

In [36]:
df=pd.DataFrame(array,index=range(1,len(array)+1),columns=['W','X','Y','Z' ])
df

           W          X          Y          Z
1  -7.157078 -15.919469 -21.815488 -42.042244
2  -5.287447 -14.627668 -17.269195 -15.354940
3  -9.001299  -8.401084  12.673783 -18.517119
4 -17.420831  -1.222689  -2.916923 -20.570550

In [37]:
df['X']

1   -15.919469
2   -14.627668
3    -8.401084
4    -1.222689
Name: X, dtype: float64

In [38]:
#si por ejemplo queremos un valor en especifico,se pone primero la columna y luego la fila
df['X'][2]

np.float64(-14.627667960852808)

In [39]:
#no es necesario poner corchetes para obtener una columna del array
df.X

1   -15.919469
2   -14.627668
3    -8.401084
4    -1.222689
Name: X, dtype: float64

In [40]:
#podemos mandar a llamar varias columnas,los primeros corchetes son para los slicings y los segundos son para crear la lista
df[['W','Y' ]]

           W          Y
1  -7.157078 -21.815488
2  -5.287447 -17.269195
3  -9.001299  12.673783
4 -17.420831  -2.916923

In [41]:
#operaciones de los dataframes
df['suma_X_Z' ]=df.X + df.Z
df

           W          X          Y          Z   suma_X_Z
1  -7.157078 -15.919469 -21.815488 -42.042244 -57.961713
2  -5.287447 -14.627668 -17.269195 -15.354940 -29.982608
3  -9.001299  -8.401084  12.673783 -18.517119 -26.918203
4 -17.420831  -1.222689  -2.916923 -20.570550 -21.793239

In [42]:
# axis=1 es para borrar columnas, axis=0 es para borrar filas
df.drop('Y',axis=1)

           W          X          Z   suma_X_Z
1  -7.157078 -15.919469 -42.042244 -57.961713
2  -5.287447 -14.627668 -15.354940 -29.982608
3  -9.001299  -8.401084 -18.517119 -26.918203
4 -17.420831  -1.222689 -20.570550 -21.793239

In [43]:
#lo anterior no borra en su totalidad la columna,para ello es necesario modificar la dataframe original
df

           W          X          Y          Z   suma_X_Z
1  -7.157078 -15.919469 -21.815488 -42.042244 -57.961713
2  -5.287447 -14.627668 -17.269195 -15.354940 -29.982608
3  -9.001299  -8.401084  12.673783 -18.517119 -26.918203
4 -17.420831  -1.222689  -2.916923 -20.570550 -21.793239

In [45]:
# mediante loc es como se puede acceder a las filas del dataframe
df.loc[1]

W           -7.157078
X          -15.919469
Y          -21.815488
Z          -42.042244
suma_X_Z   -57.961713
Name: 1, dtype: float64

In [46]:
df.iloc[[0,2 ] ]

          W          X          Y          Z   suma_X_Z
1 -7.157078 -15.919469 -21.815488 -42.042244 -57.961713
3 -9.001299  -8.401084  12.673783 -18.517119 -26.918203

In [47]:
df.loc[ 3,'X']

np.float64(-8.401084279464657)

In [48]:
df.loc[[2,4 ], ['X','suma_X_Z' ] ]

           X   suma_X_Z
2 -14.627668 -29.982608
4  -1.222689 -21.793239